Revit 2026 API

# RebarConstrainedHandleMove Method

---

Moves the handle with the specified vector. This function applies only for shape driven rebar.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Move(
	XYZ translataion
)
```
```vb
Public Sub Move (
	translataion As XYZ
)
```
```cpp
public:
void Move(
	XYZ^ translataion
)
```
```fsharp
member Move :
        translataion : XYZ -> unit
```

#### Parameters

translataion XYZ
     The translation vector that will be applied.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | RebarConstrainedHandle is no longer valid. -or- This handle doesn't belongs to a shape driven rebar. |

#### Reference

RebarConstrainedHandle Class

Autodesk.Revit.DB.Structure Namespace